# GetGraphicOverrides Method (WorksetId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingDisplaySettings..::..GetGraphicOverrides Method (WorksetId)
WorksharingDisplaySettings Class See Also
---
Returns the graphic overrides assigned to elements in a particular workset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WorksharingDisplayGraphicSettings GetGraphicOverrides(
	WorksetId worksetId
)
```

Visual Basic
---
```text
Public Function GetGraphicOverrides ( _
	worksetId As WorksetId _
) As WorksharingDisplayGraphicSettings
```

Visual C++
---
```text
public:
WorksharingDisplayGraphicSettings^ GetGraphicOverrides(
	WorksetId^ worksetId
)
```

# ### Parameters
worksetId
    Type: Autodesk.Revit.DB..::..WorksetId The workset id of interest. This must be a user workset.
# ### Return Value
Returns the graphic overrides assigned to the workset.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | worksetId does not correspond to a user workset in the document containing this WorksharingDisplaySettings. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WorksharingDisplaySettings Class
GetGraphicOverrides Overload
Autodesk.Revit.DB Namespace